
/****************************************************************************************************/
//=========================================电源接线================================================//
//     LCD模块                CH32单片机
//      VCC          接        DC5V/3.3V      //电源
//      GND          接          GND          //电源地
//=======================================液晶屏数据线接线==========================================//
//本模块默认数据总线类型为SPI总线
//     LCD模块                CH32单片机    
//       SDA         接          PA7         //液晶屏SPI总线数据写信号
//=======================================液晶屏控制线接线==========================================//
//     LCD模块 					      CH32单片机 
//       LED         接          PB6         //液晶屏背光控制信号，如果不需要控制，接5V或3.3V
//       SCK         接          PA5         //液晶屏SPI总线时钟信号
//       A0          接          PB7         //液晶屏数据/命令控制信号
//       RESET       接          PB8         //液晶屏复位控制信号
//       CS          接          PB9         //液晶屏片选控制信号
//=========================================触摸屏触接线=========================================//
//模块不带触摸功能，不需要进行触摸屏接线

#include "sys.h"

#ifndef _SPI_H_
#define _SPI_H_


/*以下部分为高改编，有修改，主要是为了LCD驱动能适配STM32标准库--不甘心的咸鱼注*/	 
#define CTLR1  CR1
#define DATAR  DR
#define STATR  SR
#define BSHR   BSRR
#define BCR    BRR


//本测试程序使用的是硬件SPI接口驱动
//除了SPI时钟信号以及SPI读、写信号引脚不可更改，其他引脚都可以更改
//SPI的时钟引脚定义固定为PA5
//SPI的读数据引脚定义固定为PA6
//SPI的写数据引脚定义固定为PA7
 
u8 SPI_WriteByte(SPI_TypeDef* SPIx,u8 Byte);
void SPI1_Init(void);
void SPI_SetSpeed(SPI_TypeDef* SPIx,u8 SpeedSet);

#endif
